МПР/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Справки2ЕГАИС</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/InformationRegisters/ПодарочныеСертификатыКСписаниюСервисЛояльности/ПодарочныеСертификатыКСписаниюСервисЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодарочныеСертификатыКСписаниюСервисЛояльности</name>
  <resources>
    <name>КСписанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПодарочныйСертификат</name>
    <type>
      <types>DefinedType.ПодарочныйСертификатСервисЛояльности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>DefinedType.СерийныйНомерСервисЛояльности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/AccumulationRegisters/ПодарочныеСертификаты/ПодарочныеСертификаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПодарочныеСертификаты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПодарочныйСертификат</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСертификата</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

МПР/src/InformationRegisters/СостояниеПодарочныхСертификатовСервисЛояльности/СостояниеПодарочныхСертификатовСервисЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеПодарочныхСертификатовСервисЛояльности</name>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодарочныйСертификат</name>
    <type>
      <types>DefinedType.ПодарочныйСертификатСервисЛояльности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>DefinedType.СерийныйНомерСервисЛояльности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>GMB</name>
      <description>GetMeBack</description>
    </items>
    <items>
      <name>UDS</name>
      <description>UDS</description>
    </items>
  </predefined>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.БонусныеПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДляНакоплений</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВладельцаКартыПоШаблону</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИнтернетМагазин</name>
      <description>Интернет-магазин</description>
    </items>
  </predefined>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикОплаты</name>
    <type>
      <types>CatalogRef.ГрафикиОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСистемаНалогообложения</name>
    <type>
      <types>EnumRef.УдалитьСистемыНалогообложения</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастникЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/CommonModules/СервисЛояльностиПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Производит разблокировку бонусов клиента при записи документа
//
Процедура РазблокироватьБонусыПриЗаписи(Источник, Отказ) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

// Выполняет обработку состояния бонусов клиентов
// Происходит проверка наличия заблокированных бонусов клиентов
// Если такие найдены и время экспирации для них истекло - происходит разблокировка
Процедура ОбработкаСостоянияБонусов() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

// Возвращает остатки бонусных баллов клиента
//
// Праметры: 
//  ДисконтнаяКарта - СправочникСсылка.ИнформационныеКарты
//
// Возвращаемое значение:
//	Структура - данные о бонусах клиента
//
Функция ПолучитьБонусыКлиента(ДисконтнаяКарта) Экспорт
	Возврат БонусныеБаллыСервер.ОстаткиИДвиженияБонусныхБаллов(ДисконтнаяКарта);	
КонецФункции

// Производит поиск карты клиента по параметрам, полученным через http-сервис
//
// Праметры: 
//  ПараметрыМетода - Структура - структура, содержащая в себе параметры клиента: ИдентификаторКартыКлиента, АдресЭП, НомерТелефона
//
// Возвращаемое значение:
//	СправочникСсылка.ИнформационныеКарты, Неопределено - дисконтная карта клиента
//
Функция НайтиКартуКлиента(ПараметрыМетода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Приоритет КАК Приоритет
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ИнформационныеКарты.Ссылка КАК Ссылка,
		|		1 КАК Приоритет
		|	ИЗ
		|		Справочник.ИнформационныеКарты КАК ИнформационныеКарты
		|	ГДЕ
		|		(ИнформационныеКарты.КодКарты = &ИдентификаторКартыКлиента
		|				ИЛИ ИнформационныеКарты.Наименование = &ИдентификаторКартыКлиента)
		|		И НЕ ИнформационныеКарты.ПометкаУдаления
		|		И &ИдентификаторКартыКлиента <> """"
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Штрихкоды.Владелец,
		|		1
		|	ИЗ
		|		РегистрСведений.Штрихкоды КАК Штрихкоды
		|	ГДЕ
		|		&ИдентификаторКартыКлиента <> """"
		|		И Штрихкоды.Штрихкод = &ИдентификаторКартыКлиента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИнформационныеКарты.Ссылка,
		|		1
		|	ИЗ
		|		Справочник.ИнформационныеКарты КАК ИнформационныеКарты
		|	ГДЕ
		|		&ВладелецКарты <> """"
		|		И ВЫБОР
		|				КОГДА ИнформационныеКарты.ВладелецКарты ССЫЛКА Справочник.Контрагенты
		|					ТОГДА ВЫРАЗИТЬ(ИнформационныеКарты.ВладелецКарты КАК Справочник.Контрагенты).Наименование = &ВладелецКарты
		|				КОГДА ИнформационныеКарты.ВладелецКарты ССЫЛКА Справочник.ФизическиеЛица
		|					ТОГДА ВЫРАЗИТЬ(ИнформационныеКарты.ВладелецКарты КАК Справочник.ФизическиеЛица).Наименование = &ВладелецКарты
		|				КОГДА ИнформационныеКарты.ВладелецКарты ССЫЛКА Справочник.Пользователи
		|					ТОГДА ВЫРАЗИТЬ(ИнформационныеКарты.ВладелецКарты КАК Справочник.Пользователи).Наименование = &ВладелецКарты
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИнформационныеКартыКонтактнаяИнформация.Ссылка,
		|		2
		|	ИЗ
		|		Справочник.ИнформационныеКарты.КонтактнаяИнформация КАК ИнформационныеКартыКонтактнаяИнформация
		|	ГДЕ
		|		(&АдресЭП <> """"
		|					И ИнформационныеКартыКонтактнаяИнформация.АдресЭП = &АдресЭП
		|					И ИнформационныеКартыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|				ИЛИ &НомерТелефона <> """"
		|					И ИнформационныеКартыКонтактнаяИнформация.НомерТелефона = &НомерТелефона
		|					И ИнформационныеКартыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|		И НЕ ИнформационныеКартыКонтактнаяИнформация.Ссылка.ПометкаУдаления
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИнформационныеКарты.Ссылка,
		|		3
		|	ИЗ
		|		Справочник.ИнформационныеКарты КАК ИнформационныеКарты
		|	ГДЕ
		|		ИнформационныеКарты.ВладелецКарты В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка
		|				ИЗ
		|					Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|				ГДЕ
		|					(&АдресЭП <> """"
		|							И ФизическиеЛицаКонтактнаяИнформация.АдресЭП = &АдресЭП
		|							И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|						ИЛИ &НомерТелефона <> """"
		|							И ФизическиеЛицаКонтактнаяИнформация.НомерТелефона = &НомерТелефона
		|							И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|					И НЕ ФизическиеЛицаКонтактнаяИнформация.Ссылка.ПометкаУдаления)
		|		И НЕ ИнформационныеКарты.ПометкаУдаления) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Приоритет";
	
	Запрос.УстановитьПараметр("ИдентификаторКартыКлиента", ПараметрыМетода.ИдентификаторКартыКлиента);
	Запрос.УстановитьПараметр("ВладелецКарты", ПараметрыМетода.Клиент);
	Запрос.УстановитьПараметр("АдресЭП", ПараметрыМетода.АдресЭП);
	Запрос.УстановитьПараметр("НомерТелефона", ПараметрыМетода.НомерТелефона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Производит поиск подарочного сертификата по параметрам, полученным через http-сервис
//
// Параметры:
//  ПараметрыМетода - Структура - структура, содержащая в себе параметры подарочного сертификата
//
// Возвращаемое значение:
//  СправочникСсылка.Номенклатура, Неопределено - подарочный сертификат
//
Функция НайтиПодарочныйСертификат(ПараметрыМетода) Экспорт
	
	ДанныеСертификата = Новый Структура;
	ДанныеСертификата.Вставить("СерийныйНомер"			, Неопределено);
	ДанныеСертификата.Вставить("ПодарочныйСертификат"	, Неопределено);
	
	Попытка
		ДанныеСертификата.СерийныйНомер = Справочники.СерийныеНомера.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыМетода.НомерСертификата));
		ДанныеСертификата.ПодарочныйСертификат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСертификата.СерийныйНомер, "Владелец");
	Исключение
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СерийныеНомера.Ссылка КАК СерийныйНомер,
		|	СерийныеНомера.Владелец КАК ПодарочныйСертификат,
		|	1 КАК Приоритет
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	(СерийныеНомера.Код = &НомерСертификата
		|			ИЛИ СерийныеНомера.Наименование = &НомерСертификата)
		|	И НЕ СерийныеНомера.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка),
		|	Номенклатура.Ссылка,
		|	2
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	(Номенклатура.Код = &НомерСертификата
		|			ИЛИ Номенклатура.Наименование = &НомерСертификата)
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Штрихкоды.Владелец КАК Справочник.СерийныеНомера),
		|	ВЫРАЗИТЬ(Штрихкоды.Владелец КАК Справочник.СерийныеНомера).Владелец,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(Штрихкоды.Владелец КАК Справочник.СерийныеНомера).Владелец.ТипСерийногоНомера = ЗНАЧЕНИЕ(Перечисление.ТипыСерийныхНомеровСертификатов.Магнитный)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец ССЫЛКА Справочник.СерийныеНомера
		|	И Штрихкоды.Штрихкод = &НомерСертификата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		
		Запрос.УстановитьПараметр("НомерСертификата", ПараметрыМетода.НомерСертификата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ЗаполнитьЗначенияСвойств(ДанныеСертификата, Выборка);
		КонецЕсли;
	
	КонецПопытки;
	
	Возврат ДанныеСертификата;
	
КонецФункции

// Возвращает данные о подарочном сертификате
//
// Параметры:
//  ПараметрыМетода - Структура
//
// Возвращаемое значение:
//  Структура - данные о подарочном сертификате
//  Неопределено - если данные не найдены
//
Функция ПолучитьБалансПодарочногоСертификата(ДанныеСертификата, СтруктураОтвета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ПодарочныеСертификатыКСписаниюСервисЛояльности.КСписанию) КАК КСписанию,
		|	ПодарочныеСертификатыКСписаниюСервисЛояльности.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ПодарочныеСертификатыКСписаниюСервисЛояльности.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ ВТ_ПодарочныеСертификатыРезерв
		|ИЗ
		|	РегистрСведений.ПодарочныеСертификатыКСписаниюСервисЛояльности КАК ПодарочныеСертификатыКСписаниюСервисЛояльности
		|ГДЕ
		|	ПодарочныеСертификатыКСписаниюСервисЛояльности.ПодарочныйСертификат = &ПодарочныйСертификат
		|	И ПодарочныеСертификатыКСписаниюСервисЛояльности.СерийныйНомер = &СерийныйНомер
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодарочныеСертификатыКСписаниюСервисЛояльности.ПодарочныйСертификат,
		|	ПодарочныеСертификатыКСписаниюСервисЛояльности.СерийныйНомер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПодарочныйСертификат,
		|	СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодарочныеСертификатыОстатки.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ПодарочныеСертификатыОстатки.НомерСертификата КАК НомерСертификата,
		|	ПодарочныеСертификатыОстатки.ПодарочныйСертификат.Номинал КАК Номинал,
		|	ВЫБОР
		|		КОГДА СостояниеПодарочныхСертификатов.ПодарочныйСертификат ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ВТ_ПодарочныеСертификатыРезерв.КСписанию, 0) > ПодарочныеСертификатыОстатки.СуммаОстаток
		|						ТОГДА 0
		|					ИНАЧЕ ПодарочныеСертификатыОстатки.СуммаОстаток - ЕСТЬNULL(ВТ_ПодарочныеСертификатыРезерв.КСписанию, 0)
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Остаток,
		|	ВЫБОР
		|		КОГДА СостояниеПодарочныхСертификатов.ПодарочныйСертификат ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Заблокирован
		|ИЗ
		|	РегистрНакопления.ПодарочныеСертификаты.Остатки(
		|			&ДатаЗапроса,
		|			НомерСертификата = &СерийныйНомер
		|				И ПодарочныйСертификат = &ПодарочныйСертификат) КАК ПодарочныеСертификатыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеПодарочныхСертификатовСервисЛояльности КАК СостояниеПодарочныхСертификатов
		|		ПО ПодарочныеСертификатыОстатки.ПодарочныйСертификат = СостояниеПодарочныхСертификатов.ПодарочныйСертификат
		|			И ПодарочныеСертификатыОстатки.НомерСертификата = СостояниеПодарочныхСертификатов.СерийныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодарочныеСертификатыРезерв КАК ВТ_ПодарочныеСертификатыРезерв
		|		ПО ПодарочныеСертификатыОстатки.ПодарочныйСертификат = ВТ_ПодарочныеСертификатыРезерв.ПодарочныйСертификат
		|			И ПодарочныеСертификатыОстатки.НомерСертификата = ВТ_ПодарочныеСертификатыРезерв.СерийныйНомер";
	
	Запрос.УстановитьПараметр("ДатаЗапроса"				, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПодарочныйСертификат"	, ДанныеСертификата.ПодарочныйСертификат);
	Запрос.УстановитьПараметр("СерийныйНомер"			, ДанныеСертификата.СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		СтруктураОтвета.GiftCard.GiftCardName = Строка(Выборка.ПодарочныйСертификат);
		СтруктураОтвета.GiftCard.GiftCardRef  = XMLСтрока(Выборка.ПодарочныйСертификат);
		СтруктураОтвета.GiftCardNumber 		  = Строка(Выборка.НомерСертификата);
		СтруктураОтвета.GiftCardValue 		  = Выборка.Номинал;
		СтруктураОтвета.GiftCardBalance 	  = Выборка.Остаток;
		СтруктураОтвета.Blocked 	  		  = Выборка.Заблокирован;
		
		СервисЛояльности.ЗаблокироватьПодарочныйСертификат(ДанныеСертификата, ТекущаяДатаСеанса());
	КонецЕсли;
	
КонецФункции

// Возврашает код валюты
//
// Возвращаемое значение:
//  Строка - код валюты
//
Функция КодВалюты() Экспорт
	Возврат ОбщегоНазначенияРТКлиентСервер.КодВалюты();
КонецФункции

// Возвращает номер дисконтной карты
//
// Параметры:
//  ДисконтнаяКарта - СправочникСсылка.ИнформационныеКарты
//
// Возвращаемое значение:
//  Число
//
Функция ПолучитьНомерКарты(ДисконтнаяКарта) Экспорт
	
	Если ДисконтнаяКарта.ВидКарты = Перечисления.ВидыИнформационныхКарт.Штриховая Тогда
		
		ДанныеШтрихКода = ПодключаемоеОборудованиеРТ.ШтрихкодТовара(ДисконтнаяКарта);
		Если Не ДанныеШтрихКода = Неопределено Тогда
			НомерКарты = ДанныеШтрихКода.Штрихкод;
		КонецЕсли;

	Иначе
		НомерКарты = ДисконтнаяКарта.КодКарты;
	КонецЕсли;
	
	Возврат НомерКарты;
	
КонецФункции

// Возвращает номер телефона владельца карты
//
// Параметры:
//  ВладелецКарты - СправочникСсылка.ФизическиеЛица
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьНомерТелефонаВладельца(ВладелецКарты) Экспорт
	
	НомерТелефона = ""; 
	
	Если ВладелецКарты = Неопределено Тогда 
		Возврат НомерТелефона
	КонецЕсли;
	
	Для Каждого СтрокаКИ Из ВладелецКарты.КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
			НомерТелефона = СтрокаКИ.Представление;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерТелефона;
	
КонецФункции

// Возвращает структуру запрета продаж
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Магазин 	- СправочникСсылка.Магазины
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьСтруктуруЗапретаПродаж(Организация = Неопределено, Магазин = Неопределено) Экспорт
	
	ДанныеОрганизации = Новый Структура;
	ДанныеОрганизации.Вставить("Name", ?(ЗначениеЗаполнено(Организация), Организация.Наименование, ""));
	ДанныеОрганизации.Вставить("Ref" , ?(ЗначениеЗаполнено(Организация), XMLСтрока(Организация)  , ""));
	ДанныеОрганизации.Вставить("ID"  , ?(ЗначениеЗаполнено(Организация), Организация.Код		 , ""));
	ДанныеОрганизации.Вставить("TIN" , ?(ЗначениеЗаполнено(Организация), Организация.ИНН		 , ""));
	
	ДанныеМагазина = Новый Структура;
	ДанныеМагазина.Вставить("Name", ?(ЗначениеЗаполнено(Магазин), Магазин.Наименование, ""));
	ДанныеМагазина.Вставить("Ref" , ?(ЗначениеЗаполнено(Магазин), XMLСтрока(Магазин)  , ""));
	ДанныеМагазина.Вставить("ID"  , ?(ЗначениеЗаполнено(Магазин), Магазин.Код		  , ""));
	
	
	СтруктураЗапретаПродаж = Новый Структура;
	СтруктураЗапретаПродаж.Вставить("StartDate"			, "");
	СтруктураЗапретаПродаж.Вставить("EndDate"			, "");
	
	СтруктураЗапретаПродаж.Вставить("SalesPromotionID"	, "");
	СтруктураЗапретаПродаж.Вставить("SalesPromotionName", "");
 	СтруктураЗапретаПродаж.Вставить("Organisation"		, ДанныеОрганизации);
	СтруктураЗапретаПродаж.Вставить("Store"				, ДанныеМагазина);
	СтруктураЗапретаПродаж.Вставить("DaysOfWeek"		, Новый Массив);
	СтруктураЗапретаПродаж.Вставить("TypesOfGoods"		, Новый Массив);
	
	Возврат СтруктураЗапретаПродаж;

КонецФункции

// Возвращает структуру содержащую данные о днях недели
//
// Параметры:
//  ДеньНедели - Перечисление.ДниНедели
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьСтруктуруДниНедели(ДеньНедели) Экспорт
	
	СтруктураДеньНедели = Новый Структура;
	СтруктураДеньНедели.Вставить("Name", Строка(ДеньНедели));
	СтруктураДеньНедели.Вставить("Ref" , XMLСтрока(ДеньНедели));
	
	СтруктураДниНедели = Новый Структура;
	СтруктураДниНедели.Вставить("DayOfWeek", СтруктураДеньНедели);
	СтруктураДниНедели.Вставить("StartTime", "");
	СтруктураДниНедели.Вставить("EndTime"  , "");
	
	Возврат СтруктураДниНедели;
	
КонецФункции

// Возвращает структуру содержащую данные о видах номенклатуры
//
// Параметры:
//  ВидНоменклатуры  - СправочникСсылка.ВидыНоменклатуры
//  ОсобенностьУчета - Перечисление.ОсобенностиУчета
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьСтруктуруВидыНоменклатуры(ВидНоменклатуры = Неопределено, ОсобенностьУчета = Неопределено) Экспорт
	
	ДанныеВидаНоменклатуры = Новый Структура;
	ДанныеВидаНоменклатуры.Вставить("Name", ?(ЗначениеЗаполнено(ВидНоменклатуры), ВидНоменклатуры.Наименование, ""));
	ДанныеВидаНоменклатуры.Вставить("Ref" , ?(ЗначениеЗаполнено(ВидНоменклатуры), XMLСтрока(ВидНоменклатуры), ""));
	
	ДанныеУсловияПредоставления = Новый Структура;
	ДанныеУсловияПредоставления.Вставить("Name", ?(ЗначениеЗаполнено(ОсобенностьУчета), Строка(ОсобенностьУчета), "")); 
	ДанныеУсловияПредоставления.Вставить("Ref",  ?(ЗначениеЗаполнено(ОсобенностьУчета), XMLСтрока(ОсобенностьУчета)  , "")); 
	
	СтруктураВидыНоменклатуры = Новый Структура;
	СтруктураВидыНоменклатуры.Вставить("TypeOfGoods", ДанныеВидаНоменклатуры);
	СтруктураВидыНоменклатуры.Вставить("Feature"	, ДанныеУсловияПредоставления);
	
	Возврат СтруктураВидыНоменклатуры;
	
КонецФункции

// Возвращает данные о магазине
//
// Параметры:
//  Магазин  - Строка
//
// Возвращаемое значение:
//  Магазин - СправочникСсылка.Магазины
//
Функция НайтиМагазин(Магазин) Экспорт
	
	Попытка
		МагазинСсылка = Справочники.Магазины.ПолучитьСсылку(Новый УникальныйИдентификатор(Магазин));
	Исключение
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Магазины.Ссылка КАК Ссылка,
		|	1 КАК Приоритет
		|ИЗ
		|	Справочник.Магазины КАК Магазины
		|ГДЕ
		|	Магазины.Код = &Магазин
		|	И НЕ Магазины.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Магазины.Ссылка,
		|	2
		|ИЗ
		|	Справочник.Магазины КАК Магазины
		|ГДЕ
		|	Магазины.Наименование = &Магазин
		|	И НЕ Магазины.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		
		Запрос.УстановитьПараметр("Магазин", Магазин);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда 
			МагазинСсылка = Выборка.Ссылка;	
		Иначе 
			МагазинСсылка = Справочники.Магазины.ПустаяСсылка();
		КонецЕсли;

	КонецПопытки;
	
	Возврат МагазинСсылка;
	
КонецФункции

// Возвращает данные об использовании автоматических скидок
//
// Возвращаемое значение:
//  Булево - использование автоматических скидок в конфигурации
//
Функция ИспользоватьАвтоматическиеСкидки() Экспорт
	
	Возврат СервисЛояльности.ИспользоватьАвтоматическиеСкидки();
	
КонецФункции

// Рассчитывает автоматические скидки
//
// Возвращаемое значение:
//  Структура - структура данных с расчитанными автоматическими скидками
//
Функция РассчитатьАвтоматическиеСкидки(ПараметрыРасчета) Экспорт
	
	Возврат СервисЛояльности.РассчитатьАвтоматическиеСкидки(ПараметрыРасчета);
	
КонецФункции

// Преобразует параметры расчета, полученный в JSON
// в структуру данных
//
// Возвращаемое значение:
//  Структура - структура данных для расчета автоматических скидок
//
Функция ДесериализоватьПараметрыРасчета(ВходящиеДанные) Экспорт
	
	Возврат СервисЛояльности.ДесериализоватьПараметрыРасчета(ВходящиеДанные);	
	
КонецФункции

// Возвращает массив получателей скидок
//
// Параметры:
//  МассивДисконтныхКарт - Массив
//
Функция СформироватьМассивПолучателейСкидок(МассивДисконтныхКарт) Экспорт
	Возврат СервисЛояльности.СформироватьМассивПолучателейСкидок(МассивДисконтныхКарт);
КонецФункции

// Выполняет создание карты клиента
//
// Параметры:
//  ДанныеКарты - Структура - содержит данные карты, исходя из которых система создаст элемент справочника
//
// Возвращаемое значение:
//  СправочникСсылка.ИнформационныеКарты
//
Функция СоздатьКартуКлиента(ДанныеКарты) Экспорт
	Возврат СервисЛояльности.СоздатьКартуКлиента(ДанныеКарты);
КонецФункции

#КонецОбласти
